# -*- coding: utf-8 -*-

## Используйте файл lesson15.py для решения задач.

## --------------------------------------------------
## Задача 1
## --------------------------------------------------

"""
В классе Teacher переопределите метод raise_salary,
чтоб при его вызове без аргументов зарплата увеличивалась
на 10 процентов.
"""


## --------------------------------------------------
## Задача 2
## --------------------------------------------------

"""
В классе Worker добавьте конструктор по типу, как в
классе Teacher.
"""


## --------------------------------------------------
## Задача 3
## --------------------------------------------------

"""
В классе Worker переопределите метод raise_salary, чтоб
при его вызове, зарплата увеличивалась на 7 процентов,
плюс бонус.

"""

## --------------------------------------------------
## Задача 4
## --------------------------------------------------

"""
Добавьте класс Klass, который в конструкторе будет сохранять
имя класса (напимер "3В") и пустой список учеников. Так же
добавьте методы для: добавления, удаления и вывода списка
учеников этого класса.
"""


## --------------------------------------------------
## Задача 5
## --------------------------------------------------

"""
Добавьте тесты ко всем методам новых классов.
"""
