# coding: utf-8

# ----------------------------------------------------------------------------
# Задача 1
# ----------------------------------------------------------------------------
"""
Используя инструкцию if, elif, else посчитайте сколько буквенных, числовых и
специальных символов в строке.
"""

s1 = '#sgl9_*dm54p0×&d2'


# ----------------------------------------------------------------------------
# Задача 2
# ----------------------------------------------------------------------------
"""
Напишите код, который будет проверять введённые пользователем данные, являются
ли символы только буквами. Используйте инструкцию try, except, else.
"""

# ----------------------------------------------------------------------------
# Задача 3
# ----------------------------------------------------------------------------
"""
Нарисуйте “ёлочку” используя символ решетка “#” с выравниваем по правому краю.
Необходимо использовать форматирования строки и встроенный метод стоки format.
Пример (сдвиг по правому краю):
     #
    ##
   ###
  ####
 #####
######
"""


# -----------------------------------------------------------------------------
# Задача 4
# -----------------------------------------------------------------------------
"""
Есть структура данных список кортежей с двумя элементами, которая представляет
упрощенную структуру для учета постояльцев гостиницы, где первая цифра день заезда,
вторая цифра день отъезда (оба дня включены). Посчитайте в какой день гостиница
имеет наибольшее число постояльцев и выведите его. Если таких дней несколько,
выведите все.
Пример структуры:
"""

l1 = [(2, 7), (4, 9), (3, 6), (7, 9), (4, 12), (6, 11), (7, 10), (5, 25), (6, 9)]



# ---------------------------------------------------------------------------------
# Задача 5
# ---------------------------------------------------------------------------------
"""
С этого дня мы начинаем писать игру “крестики-нолики”. Сегодня мы представим внутреннюю
структуру для хранения информации какой ход сделал игрок. Придумайте и создайте эту
структуру и запишите в нее все клетки (размер 3×3) с начальным значением. Далее подумайте:
какие значения должен вводить игрок 1 и игрок 2; как программа будет проверять правильность
ввода игроков; как программа будет решать кто выиграл или ничейный результат.
"""
