# coding: utf-8


# --------------------------------------------------
# Задача 1
# --------------------------------------------------
"""
Напишите код, который будет выводить последовательность
Фибоначи. Первые две цифры возвращают единицу и последняя
не больше 1000.\
Пример: [0, 1, 1, 2, 3, 5, 8, 13, 21, ...]
"""
l1 = []


# --------------------------------------------------
# Задача 2
# --------------------------------------------------
"""
Напишите программу, которая будет находить числа
делящиея без остатка на 7, но не делящиеся на 5.
Пример: 35 не подходит, а 49 подходит
"""
l2 = xrange(2000, 3200)


# --------------------------------------------------
# Задача 3
# --------------------------------------------------
"""
Напишите программу, которая будет брать строку со словами
разделёнными пробелами и возвращать тоже строк, но слова
не должны дублироваться.
Пример: IN: 'hello world and practice makes perfect and hello
world again' OUT: 'again and hello makes perfect practice world'
"""


# --------------------------------------------------
# Задача 4
# --------------------------------------------------
"""
Дан список четырёхзначные бинарных чисел, необходимо
вывести только те, двоичное представление которых
делиться на 5 без остатка.
"""
l3 = ['0001', '0010', '0011', '0100', '0101',
      '0110', '0111', '1000', '1001', '1010',
      '1011', '1100', '1101', '1110', '1111']


# --------------------------------------------------
# Задача 5
# --------------------------------------------------
"""
Дан файл (count.txt) с несколькими строками и  форматом:
D 300
W 130
где D поступления, W снятие со счёта (операций может
быть многл). Выведите общую сумму, оставшуюся на счёте.
"""
