# -*- coding: utf-8 -*-

# --------------------------------------------------
# Задача 1
# --------------------------------------------------
"""
Напишите функцию с тремя аргументами, которая будет
возводить число в степень и делить на число значения
последнего аргументама. Пример: fun(5, 2, 3) -> 8.33
"""

# --------------------------------------------------
# Задача 2
# --------------------------------------------------
"""
Напишите ту-же функцию используя lambda выражение.
"""

# --------------------------------------------------
# Задача 3
# --------------------------------------------------
"""
Напишите замыкание (функцию фабрику), которая будет
вычеслять площадь прямоугольника.
"""

# --------------------------------------------------
# Задача 4
# --------------------------------------------------
"""
Написать ту-же функциюи используя lambda выражение.
"""

# --------------------------------------------------
# Задача 5
# --------------------------------------------------
"""
Напишите код, который будет искать переменные или
функции во всех областях видимости (помните LEGB?).
Выведите значения для переменных, а функции просто
вызовите и введите результат.
"""
