# coding: utf-8

##############################
## Задание 1
##############################

u"""
Написать последовательность выражений
для сбора имени и фамилии (два вопроса)
используя функцию input() и вывести используя
print()
"""


##############################
## Задание 2
##############################

u"""
Сгенерировать и вывести последовательность
или список чисел от 1 до 20.
Написать и вывести словарь с данными, где
ключ имя фрукта, значение количество.
"""


##############################
## Задание 3
##############################

u"""
Вывести новый список используя список из
предыдущего задания, где каждый элемент
будет умножен на 2. Используйте конструцкцию for.
"""


##############################
## Задание 4
##############################

u"""
Используя срез вывести символы со 2 по 7 включительно
и 5 символов с конца заданной строки.
"""
s = 'Python_is_a_very_popular_language!'


##############################
## Задание 5
##############################

u"""
Используя заданную строку вывести чётные символы.
Используя for для итерации метод строки index() для
определения порядкового номера символа в строке
и деления по остатку,символ %.
"""
s = 'Python_is_a_very_popular_language!'
